// NUMBER
// null // отсутствие данных - запланированное, программист знает об этом, так и должно быть
// undefined // отсутсвие данных - скорей всего где то ошибка


// 7 примитивов
// Number
// String
// Boolean
// BigInt
// Symbol
// null
// undefined


// Переменные

// let
// если не знаем что вложить в переменную, прописывать = null
// let a // не стоит так делать. тип данных в таком случае - undefined
// let a = null // правильный подход. тип данных в таком случае - null
// для let следует всегда использовать camelCase

// const
// const требует сразу объявления переменной

// const a - неправильно, будет ошибка
// a = 0
// const a = 0 - правильно

// для глобальный переменных const следует испольовать snakekeys в верхнем регистре, например:
// const PROJECT_NAME = 'lesson'
// для локальных const следует использовать camelCase, например:
// const color = 'red'




 

